# 구글의 전화면접 문제 중 하나.

# A, B 두명의 플레이어가 있다. 

# 한개의 선 위에 여러개의 금 항아리가 놓여져 있다. 각 항아리는 금화를 담고 있다. (플레이어는 각 항아리에 얼마의 금화가 들어있는지 알 수 있다.) 각 플레이어는 교대로 선에 놓여있는 양쪽 가장자리 항아리 중에서 한 개씩 선택 할 수 있다. (가장 우측 항아리 또는 가장 좌측 항아리 중 하나를 선택해야 한다.)

# 모든 항아리 선택이 끝난 후 가장 많은 금화를 차지한 플레이어가 승리하게 된다.
 
# 이 게임의 목표는 A가 먼저 게임을 시작할 때 A가 가장 많은(Maximize) 금화를 가질 수 있도록 하는 것이다. B 역시 최적의 알고리즘으로 항아리를 선택한다고 가정한다.
 
# A가 이길 수 있는 최선의 전략을 찾아 보시오.
 
# 그리고 이것을 프로그래밍 코드로 작성 해 보시오.

# 단순하게 봤을 때는 나에게 가장 큰 이익이 되면서 상대방에게 가장 적은 이익이 되도록 하는 수를 반복해서 취하도록 하면 될 듯한데... 게임 진행에 따른 경우의 수 트리도 만들어서 체크해야 하는지(즉, 열 수 앞을 내다봐야 하는지) 아닌지를 잘 모르겠네요. 일단 테스트 케이스를 충분히 만들어보고 생각해봐야겠네요